{
  "versionCode": 400,
  "downloadLink": "https://github.com/svkkkurai/venokUpdates/releases/download/4.0/app-release.apk",
  "changelog": {
    "en": "Meet the new, even more quirky and bug-filled... VΞNOK!!! 😎🔥\n\nThis update has completely reworked the UI logic, removing lots of unnecessary code and focusing on optimization. 🚀\nNew features have also been added. Here\u0027s what\u0027s new: 📜\n\n1️⃣ Using the MVVM pattern 🏗️\n2️⃣ Full app redesign, including a new navigation panel! 🎨🧭\n3️⃣ Added filters by artist, album, and year. Playlists and folder sorting — coming soon! 🎵🔍\n4️⃣ Modes: repeat 🔁, shuffle 🔀\n5️⃣ Sleep timer 🛌⏰\n6️⃣ Option to disable dynamic colors 🌈❌\n7️⃣ Option to use placeholders if the main track cover is unavailable 🖼️🛠️\n8️⃣ Option to disable automatic update checks 🔄❌\n\nThanks to everyone staying with us! 🙏 Boom shaka-laka! 🎉✨",
    "ru": "Встречайте — новый, ещё более баганный и странный... VΞNOK!!!1!11 😎🔥\n\nВ этом обновлении была полностью переработана логика управления пользовательским интерфейсом, что позволило убрать много лишнего кода и сосредоточиться на оптимизации. 🚀\nНе забыли добавить и новых функций. Список нововведений приведен ниже: 📜\n\n1️⃣ Использование паттерна MVVM 🏗️\n2️⃣ Полный редизайн приложения, включая новую панель навигации! 🎨🧭\n3️⃣ Добавили фильтры по исполнителям, альбомам, годам. Плейлисты и сортировка по папкам — позже! 🎵🔍\n4️⃣ Режимы: повтор 🔁, перемешать 🔀\n5️⃣ Таймер сна 🛌⏰\n6️⃣ Возможность отключить использование динамических цветов 🌈❌\n7️⃣ Возможность использования заглушек, если основная обложка трека — недоступна 🖼️🛠️\n8️⃣ Возможность отключить автоматическую проверку обновлений 🔄❌\n\nСпасибо всем, кто остаётся с нами! 🙏 Бум шака-лака! 🎉✨",
    "uk": "Зустрічайте — новий, ще більш баганий та дивакуватий... VΞNOK!!! 😎🔥\n\nУ цьому оновленні повністю перероблено логіку керування інтерфейсом, що дозволило прибрати багато зайвого коду та зосередитися на оптимізації. 🚀\nНе забули додати нові функції. Ось що нового: 📜\n\n1️⃣ Використання патерна MVVM 🏗️\n2️⃣ Повний редизайн додатку, включаючи нову панель навігації! 🎨🧭\n3️⃣ Додано фільтри за виконавцями, альбомами та роками. Плейлисти та сортування по папках — пізніше! 🎵🔍\n4️⃣ Режими: повтор 🔁, випадковий порядок 🔀\n5️⃣ Таймер сну 🛌⏰\n6️⃣ Можливість відключити динамічні кольори 🌈❌\n7️⃣ Можливість використовувати заглушки, якщо основна обкладинка треку недоступна 🖼️🛠️\n8️⃣ Можливість відключити автоматичну перевірку оновлень 🔄❌\n\nДякуємо всім, хто залишається з нами! 🙏 Бум шака-лака! 🎉✨"
  }
}